TexasInstruments/mcupsdk-core/examples/drivers/epwm/epwm_dccap/am263px-lp/r5fss0-0_nortos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM263Px" --package "ZCZ_C" --part "AM263P4" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.20.0+3600"}
 */

/**
 * Import the modules used in this configuration.
 */
const epwm            = scripting.addModule("/drivers/epwm/epwm", {}, false);
const epwm1           = epwm.addInstance();
const epwm2           = epwm.addInstance();
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();
const default_linker  = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1 = default_linker.addInstance();
const general         = scripting.addModule("/memory_configurator/general", {}, false);
const general1        = general.addInstance();
const region          = scripting.addModule("/memory_configurator/region", {}, false);
const region1         = region.addInstance();
const section         = scripting.addModule("/memory_configurator/section", {}, false);
const section1        = section.addInstance();
const section2        = section.addInstance();
const section3        = section.addInstance();
const section4        = section.addInstance();
const section5        = section.addInstance();
const section6        = section.addInstance();
const section7        = section.addInstance();
const section8        = section.addInstance();
const section9        = section.addInstance();
const section10       = section.addInstance();
const section11       = section.addInstance();
const section12       = section.addInstance();
const epwm_xbar       = scripting.addModule("/xbar/epwm_xbar/epwm_xbar", {}, false);
const epwm_xbar1      = epwm_xbar.addInstance();
const output_xbar     = scripting.addModule("/xbar/output_xbar/output_xbar", {}, false);
const output_xbar1    = output_xbar.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
epwm1.$name                                                  = "CONFIG_EPWM0";
epwm1.epwmTimebase_period                                    = 2000;
epwm1.epwmTimebase_emulationMode                             = "EPWM_EMULATION_FREE_RUN";
epwm1.epwmXCMP_enableMode                                    = true;
epwm1.epwmXMin_Active                                        = 50;
epwm1.epwmXMax_Active                                        = 200;
epwm1.epwmXTBPRD_Active                                      = 2000;
epwm1.epwmDigitalCompare_enableEventDetection                = true;
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                  = "EPWM_TZ_ACTION_LOW";
epwm1.epwmTripZone_cbcSourceAdditional                       = ["EPWM_TZ_SIGNAL_CAPEVT_CBC"];
epwm1.epwmTripZone_tzInterruptSource                         = ["EPWM_TZ_INTERRUPT_CAPEVT"];
epwm1.epwmXCMP_SplitCheck                                    = true;
epwm1.epwmXCMP_Split_A                                       = "EPWM_XCMP_2_CMPA";
epwm1.epwmXCMP_Split_B                                       = "EPWM_XCMP_2_CMPB";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_ACTIVE   = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_ACTIVE   = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_ACTIVE   = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_ACTIVE   = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmXCMP1_Active                                       = 100;
epwm1.epwmXCMP2_Active                                       = 1000;
epwm1.epwmXCMP5_Active                                       = 100;
epwm1.epwmXCMP6_Active                                       = 1000;
epwm1.epwmXLOADCTL_Shadowlevel                               = "EPWM_XCMP_XLOADCTL_SHDWLEVEL_1";
epwm1.epwmXMin_Shdw1                                         = 50;
epwm1.epwmXMax_Shdw1                                         = 200;
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_SHADOW_1 = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_SHADOW_1 = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP5_SHADOW_1 = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmXAQCTL_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_XCMP6_SHADOW_1 = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmXCMP1_Shdw1                                        = 100;
epwm1.epwmXCMP2_Shdw1                                        = 1000;
epwm1.epwmXCMP5_Shdw1                                        = 100;
epwm1.epwmXCMP6_Shdw1                                        = 1000;
epwm1.epwmXLOADCTL_Loadonce                                  = "EPWM_XCMP_XLOADCTL_SHDWBUFPTR_ONE";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                  = "EPWM_TZ_ACTION_DISABLE";
epwm1.epwmDeadband_enableRED                                 = true;
epwm1.epwmDeadband_enableFED                                 = true;
epwm1.epwmXTBPRD_Shdw1                                       = 2000;
epwm1.EPWM.$assign                                           = "EPWM0";

epwm2.$name                                                = "CONFIG_EPWM1";
epwm2.epwmTimebase_emulationMode                           = "EPWM_EMULATION_FREE_RUN";
epwm2.epwmTimebase_period                                  = 2000;
epwm2.epwmXCMP_enableMode                                  = true;
epwm2.epwmXCMP_No_Split                                    = "EPWM_XCMP_2_CMPA";
epwm2.epwmXCMP1_Active                                     = 100;
epwm2.epwmXCMP2_Active                                     = 1000;
epwm2.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP1_ACTIVE = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmXAQCTL_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_XCMP2_ACTIVE = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmXTBPRD_Active                                    = 2000;
epwm2.EPWM.$assign                                         = "EPWM1";

const soc_ctrl_adc    = scripting.addModule("/drivers/soc_ctrl/v0/subModules/soc_ctrl_adc", {}, false);
const soc_ctrl_adc1   = soc_ctrl_adc.addInstance({}, false);
soc_ctrl_adc1.$name   = "soc_ctrl_adc0";
const soc_ctrl        = scripting.addModule("/drivers/soc_ctrl/soc_ctrl", {}, false);
soc_ctrl.soc_ctrl_adc = soc_ctrl_adc1;

const soc_ctrl_cmpss    = scripting.addModule("/drivers/soc_ctrl/v0/subModules/soc_ctrl_cmpss", {}, false);
const soc_ctrl_cmpss1   = soc_ctrl_cmpss.addInstance({}, false);
soc_ctrl_cmpss1.$name   = "soc_ctrl_cmpss0";
soc_ctrl.soc_ctrl_cmpss = soc_ctrl_cmpss1;

const soc_ctrl_epwm            = scripting.addModule("/drivers/soc_ctrl/v0/subModules/soc_ctrl_epwm", {}, false);
const soc_ctrl_epwm1           = soc_ctrl_epwm.addInstance({}, false);
soc_ctrl_epwm1.$name           = "soc_ctrl_epwm0";
epwm.epwmTbClkSync             = soc_ctrl_epwm1;
soc_ctrl.soc_ctrl_epwm         = soc_ctrl_epwm1;
soc_ctrl_epwm1.tbclkSyncCtrlEn = ["EPWM0","EPWM1"];

const soc_ctrl_sdfm    = scripting.addModule("/drivers/soc_ctrl/v0/subModules/soc_ctrl_sdfm", {}, false);
const soc_ctrl_sdfm1   = soc_ctrl_sdfm.addInstance({}, false);
soc_ctrl_sdfm1.$name   = "soc_ctrl_sdfm0";
soc_ctrl.soc_ctrl_sdfm = soc_ctrl_sdfm1;

debug_log.enableUartLog            = true;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.UART.RXD.$assign = "UART0_RXD";
debug_log.uartLog.UART.TXD.$assign = "UART0_TXD";
debug_log.uartLog.child.$name      = "drivers_uart_v2_uart_v2_template0";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

